In [26]:
import pandas as pd

In [27]:
s = pd.Series([1,2,3,4])
type(s)
s1=pd.Series([1,2,3,4], index=['A','B','C','D'])

In [28]:
s1

A    1
B    2
C    3
D    4
dtype: int64

In [29]:
data = [[1,44,'abc'],
        [2,555,'def'],
        [3,666,'jrt'],
        [4,777,'asj']
        ]
df=pd.DataFrame(data,columns=['Id','std_ID','Dept'])
display(df)

   Id  std_ID Dept
0   1      44  abc
1   2     555  def
2   3     666  jrt
3   4     777  asj

In [30]:
df.columns

Index(['Id', 'std_ID', 'Dept'], dtype='str')

In [31]:
index= ['row1','row2','row3','row4']
df.index=index
display(df)

      Id  std_ID Dept
row1   1      44  abc
row2   2     555  def
row3   3     666  jrt
row4   4     777  asj

In [32]:
df.dtypes

Id        int64
std_ID    int64
Dept        str
dtype: object

In [33]:
df['Dept'].dtype

In [34]:
df['Dept'] = df['Dept'].astype('category')

In [35]:
df['Dept'].dtype

CategoricalDtype(categories=['abc', 'asj', 'def', 'jrt'], ordered=False, categories_dtype=str)

In [36]:
df.dtypes

Id           int64
std_ID       int64
Dept      category
dtype: object

In [37]:
df.tail(2)

      Id  std_ID Dept
row3   3     666  jrt
row4   4     777  asj

In [38]:
df.describe()

             Id      std_ID
count  4.000000    4.000000
mean   2.500000  510.500000
std    1.290994  323.936722
min    1.000000   44.000000
25%    1.750000  427.250000
50%    2.500000  610.500000
75%    3.250000  693.750000
max    4.000000  777.000000

In [39]:
df.describe(include='category')

       Dept
count     4
unique    4
top     abc
freq      1

In [40]:
df.index

Index(['row1', 'row2', 'row3', 'row4'], dtype='str')

In [41]:
x=df['std_ID'].unique().sum()
x

np.int64(2042)

In [42]:
df.Dept.idxmin()

'row1'

In [43]:
df.info()

<class 'pandas.DataFrame'>
Index: 4 entries, row1 to row4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Id      4 non-null      int64
 1   std_ID  4 non-null      int64
 2   Dept    4 non-null      category
dtypes: category(1), int64(2)
memory usage: 304.0+ bytes

In [ ]:
df['std_ID'].iloc[1]

np.int64(555)

In [45]:
df.iloc[:,0:2]

      Id  std_ID
row1   1      44
row2   2     555
row3   3     666
row4   4     777

In [50]:
df['new_col'] = df['std_ID']+df.Id
df

      Id  std_ID Dept  new_col
row1   1      44  abc       45
row2   2     555  def      557
row3   3     666  jrt      669
row4   4     777  asj      781

In [57]:
null=df.isnull().sum()

In [59]:
pd.DataFrame(null).T

   Id  std_ID  Dept  new_col
0   0       0     0        0

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("E:/Alsayad Electronics/Downloads/train.csv")

In [4]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
df=df.drop(["PassengerId","Ticket"],axis=1)

In [13]:
def chk_type(df):
   dtypes=df.dtypes
   n_unique=df.nunique()
   return pd.DataFrame({"Dtypes":dtypes ,"num_unique":n_unique}).T

In [14]:
chk_type(df)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
Dtypes,int64,int64,str,str,float64,int64,int64,float64,str,str
num_unique,2,3,891,2,88,7,7,248,147,3

In [16]:
chk_type(df)

           Survived Pclass  Sex      Age  SibSp  Parch Embarked
Dtypes        int64  int64  str  float64  int64  int64      str
num_unique        2      3    2       88      7      7        3

In [19]:
df=df.drop(["Age"],axis=1)

In [20]:
chk_type(df)

           Survived Pclass  Sex  SibSp  Parch Embarked
Dtypes        int64  int64  str  int64  int64      str
num_unique        2      3    2      7      7        3

In [ ]:
cols = ['Survived','Pclass','Sex','SibSp','Parch','Embarked']
##########

In [24]:
df.shape[0]

891

In [26]:
null = df.isnull().sum()
ratio= null/df.shape[0]
pd.DataFrame({"Null":null ,"Ratio": ratio}).T

       Survived  Pclass  Sex  SibSp  Parch  Embarked
Null        0.0     0.0  0.0    0.0    0.0  2.000000
Ratio       0.0     0.0  0.0    0.0    0.0  0.002245

In [27]:
df = df.dropna(subset=['Embarked'])

In [ ]:
median= df[]